{
  "docs": [
    {
      "id": "7300e347-1bc0-4971-9735-81f44cf6b1c2",
      "name": "Syllabus_CSI4999.pdf",
      "createdAt": "2025-10-13T21:59:36.516Z",
      "chunkCount": 2,
      "chunks": [
        {
          "id": 1,
          "text": "computer\nhardware that could fail.\n\n• Add/Drops: The university policy will be explicitly followed. It is the stud"
        },
        {
          "id": 2,
          "text": "ed no unauthorized assistance or\ncollaboration.\n\n(b) I understand that if I am university."
        }
      ]
    },
    {
      "id": "11c3dca5-889f-46b3-ad65-cbf483924831",
      "name": "Milestone3.pdf",
      "createdAt": "2025-11-13T03:03:07.231Z",
      "chunkCount": 2,
      "chunks": [
        {
          "id": 0,
          "text": "Milestone 3 (100 points)\nRemember that no late submissions will be accepted. Each group is allowed to request for late\nsubmission of only one of their milestones up to four hours after the deadline. After that, the\nmilestone will not be accepted.\n\nMilestone 3 submission on Moodle is due Wednesday 11/19/2025 @ 23:00, and\npresentations will take place during class on 11/12, 11/17, and 11/19 as scheduled in the\nfollowing Table.\n\n\n\ndates\n\n11/12/2025     milestone3-presentation (groups 1-4)\n\n11/17/2025     milestone3-presentation (groups 5-8)\n\n11/19/2025     milestone3-presentation (groups 9-12)\n\n\n\n\nMilestone 3 is divided into 5 parts. The first part is a report on your progress with your project\nso far. The second part is your project presentation. The third part is your updated agile project\nplan, user story template, and outline of tasks (i.e., the three spreadsheets you submitted with\nMilestone 1). The fourth part is to share your GitHub project with me (please make sure to give\nme access to the project). Finally, you will evaluate your fellow group members.\n\n\n\nReport Requirements (30 points)\nUpload a PDF document to Moodle that completes the Report Template document. Only one\nsubmission per group is required.\n\n\n\nPresentation Requirements (20 points)\nEveryone in your group will present their projects. Your presentation should be at least 25\nminutes long but no more than 30 minutes. All group members must talk for an equal amount\nof time. Your presentation should follow this outline:\n   1. Introduce everyone on the project team with your project title\n   2. Provide a brief summary of what your project does (basically remind your classmates\n      what you presented in Milestone 2)\n   3. Demo your current project functionality. You must have at least 70% of your project\n      working by this milestone.\n   4. Demo the backend and frontend code of your project that you developed so far.\n   5. Provide a brief status of what still needs to be done before Milestone 4.\n\nYou may use a PowerPoint presentation, a poster, document, or any other tool you like. Upload\nyour group’s presentation materials to Moodle (only one submission per group is required).\n\n\n\nProject Plan (20 points)\nSubmit your updated agile project plan, user story template, and outline of tasks (i.e., the three\nspreadsheets you submitted with Milestone 1). You may use a different format if you like, but\nyou must include which group mates will work on which tasks in the weeks between Milestone\n3 and Milestone 4. Only one submission per group is required.\n\n\n\nGitHub Project (20 points)\nYour project must be uploaded to GitHub and shared with me. Please make sure I have access\nto it. It is entirely up to you how to manage your branches and whether you want to make your\nrepo public or private. However, all group members must have at least 3 commits by this\nmilestone. Please note that these three commits should not be one-line changes, but rather\nreflect a meaningful contribution to the project."
        },
        {
          "id": 1,
          "text": ", all group members must have at least 3 commits by this\nmilestone. Please note that these three commits should not be one-line changes, but rather\nreflect a meaningful contribution to the project.\n\n\n\nGroup Evaluation Form (10 points)\nAll group members must submit a group evaluation form. The group evaluation forms will\nimpact your grade. There is no specific form, just write your assessment and upload it on\nMoodle along with other documents under Milestone3."
        }
      ]
    }
  ]
}